Repository: JingLinWu/os-strongswan
Catalog: debian/po/*.po
Languages: cs, de, fr, ja, pt, sv

source: Email address for the X509 certificate request:
cs: Emailová adresa pro požadavek na certifikát X509:
de: E-Mail-Adresse für die X509-Zertifikatsanfrage:
fr: Adresse électronique :
ja: X509 証明書要求に記載するメールアドレス:
pt: Endereço de email para o pedido de certificado X509:
sv: E-postadressen för X509-certifikatsförfrågan:

source: Please enter the email address of the person or organization who is responsible for the X509 certificate, This address will be placed in the certificate request.
cs: Zadejte prosím emailovou adresu osoby nebo organizace, která je zodpovědná za certifikát X509. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie die E-Mail-Adresse der Person oder Organisation ein, die für das X509-Zertifikat verantwortlich ist. Diese Adresse wird in der Zertifikatsanfrage verwandt.
fr: Veuillez indiquer l'adresse électronique de la personne ou de l'organisme responsable du certificat X509. Cette adresse sera incluse dans la demande de certificat.
ja: X509 証明書の責任者となる人物・団体のメールアドレスを入力してください。このアドレスは証明書要求に記載されます。
pt: Por favor insira o endereço de email da pessoa ou organização que é responsável pelo certificado X509. Este endereço irá ser colocado no pedido de certificado.
sv: Ange e-postadressen till den person eller organisation som ansvarar för X509-certifikatet. Denna adress kommer att placeras i certifikatsförfrågan.

source: Do you wish to enable opportunistic encryption in strongSwan?
cs: Chcete ve strongSwanu povolit oportunistické šifrování?
de: Möchten Sie opportunistische Verschlüsselung in strongSwan aktivieren?
fr: Souhaitez-vous activer le chiffrement opportuniste dans strongSwan ?
ja: strongSwan で opportunistic encryption を有効にしますか?
pt: Deseja activar encriptação oportunística no strongSwan?
sv: Vill du aktivera opportunistisk kryptering i strongSwan?

source: strongSwan comes with support for opportunistic encryption (OE), which stores IPSec authentication information (i.e. RSA public keys) in (preferably secure) DNS records. Until this is widely deployed, activating it will cause a significant slow-down for every new, outgoing connection. Since version 2.0, strongSwan upstream comes with OE enabled by default and is thus likely to break your existing connection to the Internet (i.e. your default route) as soon as pluto (the strongSwan keying daemon) is started.
cs: strongSwan přichází s podporou pro oportunistické šifrování (OE), které uchovává autentizační informace IPSecu (např. veřejné RSA klíče) v (nejlépe zabezpečených) DNS záznamech. Dokud nebude tato schopnost více rozšířena, způsobí její aktivace výrazné zpomalení každého nového odchozího spojení. Od verze 2.0 přichází strongSwan s implicitně zapnutou podporou OE čímž pravděpodobně zruší vaše probíhající spojení do Internetu (tj. vaši výchozí cestu - default route) v okamžiku, kdy spustíte pluto (strongSwan keying démon).
de: strongSwan enthält Unterstützung für opportunistische Verschlüsselung (OV), die Authentifizierungsinformationen von IPSec (z.B. öffentliche RSA-Schlüssel) in DNS-Datensätzen speichert. Solange dies nicht weit verbreitet ist, wird jede neue ausgehende Verbindung signifikant verlangsamt, falls diese Option aktiviert ist. Seit Version 2.0 wird strongSwan von den Autoren mit aktiviertem OV ausgeliefert und wird daher wahrscheinlich Ihre existierenden Verbindungen ins Internet (d.h. Ihre Standard-Route) stören, sobald Pluto (der strongSwan Schlüssel-Daemon) gestartet wird.
fr: StrongSwan gère le chiffrement opportuniste (« opportunistic encryption » : OE) qui permet de conserver les informations d'authentification IPSec (c'est-à-dire les clés publiques RSA) dans des enregistrements DNS, de préférence sécurisés. Tant que cette fonctionnalité ne sera pas déployée largement, son activation provoquera un ralentissement significatif pour toute nouvelle connexion sortante. À partir de la version 2.0, cette fonctionnalité est activée par défaut dans strongSwan, ce qui peut interrompre le fonctionnement de votre connexion à l'Internet (c'est-à-dire votre route par défaut) dès le démarrage de pluto, le démon de gestion de clés de strongSwan.
ja: strongSwan は、IPSec 認証情報 (例: RSA 公開鍵) を (願わくはセキュアな) DNS レコード内に保存する opportunistic encryption (OE) をサポートしています。これは広く利用されるようになるまで、有効にすると外部への新規接続は全て格段に遅くなります。バージョン 2.0 より strongSwan の開発元はデフォルトで OE を有効にしています。そのため pluto (strongSwan 鍵署名デーモン) が開始するとすぐ、既存のインターネット接続 (つまりデフォルトルート) が中断されるかもしれません。
pt: O strongSwan vem com suporte para encriptação oportunística (OE), a qual guarda informação de autenticação IPSec (i.e. chaves públicas RSA) em (preferêncialmente seguros) registos DNS. Até que isto seja largamente espalhado, activá-lo irá causar um abrandamento significativo para cada nova, ligação de saída. Desde a versão 2.0, upstream, o strongSwan vem com o OE activado por omissão e é por isso provável deitar abaixo a sua ligação existente à internet (i.e a sua rota por omissão) assim que o pluto (o keying daemon do strongSwan) for iniciado.
sv: strongSwan har stöd för opportunistisk kryptering (OE) som lagrar information om IPSec-autentiseringen (exempelvis publika RSA-nycklar) i (helst säkra) DNS-poster. Tills detta är en mer utbredd tjänst kan aktivering av det orsaka en betydande hastighetssänkning för varje ny utgående anslutning. Sedan version 2.0 kommer strongSwan från uppströms med OE aktiverad som standard och kommer därför sannolikt att bryta din existerande anslutning till Internet (exempelvis din standardrutt) så snart som pluto (demonen för strongSwan-nycklar) startas.

source: Please choose whether you want to enable support for OE. If unsure, do not enable it.
cs: Prosím vyberte si zda chcete povolit podporu pro OE. Nejste-li si jisti, podporu nepovolujte.
de: Bitte wählen Sie aus, ob Sie OV aktivieren möchten. Falls Sie unsicher sind, aktivieren Sie es nicht.
fr: Veuillez choisir si vous souhaitez activer la gestion du chiffrement opportuniste. Ne l'activez pas si vous n'êtes pas certain d'en avoir besoin.
ja: OE のサポートを有効にするかどうかを選んでください。よくわからない場合は、有効にはしないでください。
pt: Por favor escolha se quer activar ou não o suporte para OE. Se não tiver a certeza, não o active.
sv: Välj huruvida du vill aktivera stöd för OE. Om du är osäker bör du inte aktivera det.

source: Please enter the full location of the file containing your X509 certificate in PEM format.
ja: PEM 形式の X509 証明書を含んでいるファイルの場所を絶対パスで入力してください。

source: Please enter the length of the created RSA key. it should not be less than 1024 bits because this should be considered unsecure and you will probably not need anything more than 2048 bits because it only slows the authentication process down and is not needed at the moment.
ja: 生成する RSA 鍵の長さを入力してください。安全のため、1024 ビット未満にすべきではありません。2048 ビットより大きなものにする必要もないでしょう。認証プロセスが遅くなりますし、現時点ではおそらく必要ありません。

source: If you do not want to create a self-signed certificate, then this installer will only create the RSA private key and the certificate request and you will have to sign the certificate request with your certificate authority.
ja: 自己署名証明書を生成したくない場合、このインストーラは RSA 秘密鍵と証明書要求のみを生成します。そして、認証局に証明書要求へ署名をしてもらう必要があります。
