Repository: JingLinWu/os-strongswan
Catalog: debian/po/*.po
Languages: cs, de, fr, ja, pt, sv

source: earliest, "after NFS", "after PCMCIA"
cs: "co nejdříve", "po NFS", "po PCMCIA"
de: frühestmöglich, »nach NFS«, »nach PCMCIA«
fr: Le plus tôt possible, Après NFS, Après PCMCIA
ja: 可能な限り早く, "NFS 起動後", "PCMCIA 起動後"
pt: o mais cedo possível, "depois do NFS", "depois do PCMCIA"
sv: tidigast, "efter NFS", "efter PCMCIA"

source: When to start strongSwan:
cs: Kdy spustit strongSwan:
de: Wann soll strongSwan gestartet werden:
fr: Moment de démarrage de strongSwan :
ja: strongSwan のタイミング:
pt: Quando iniciar o strongSwan:
sv: När strongSwan ska startas om:

source: There are three possibilities when strongSwan can start: before or after the NFS services and after the PCMCIA services. The correct answer depends on your specific setup.
cs: Existují tři možnosti, kdy se dá strongSwan spouštět: před NFS službami, po NFS službách nebo po PCMCIA službách. Správná odpověď závisí na vašem konkrétním nastavení.
de: Es gibt drei Möglichkeiten, wann strongSwan starten kann: vor oder nach den NFS-Diensten und nach den PCMCIA-Diensten. Die richtige Antwort hängt von Ihrer spezifischen Einrichtung ab.
fr: Il existe trois moments où il est opportun de démarrer strongSwan : avant ou après les services NFS, ou après les services PCMCIA. La réponse appropriée dépend de vos réglages spécifiques.
ja: strongSwan を起動させるタイミングの選択肢としては3つが考えられます: NFS サービスの開始前・開始後・PCMCIA サービスの開始後、です。正解はあなたの設定次第です。
pt: Existem três possibilidades para iniciar o strongSwan: antes ou depois dos serviços NFS e depois dos serviços PCMCIA. A resposta correcta depende da sua configuração.
sv: Det finns tre möjligheter för när strongSwan kan startas: före eller efter NFS-tjänsterna samt efter PCMCIA-tjänsterna. Det rätta svaret beror på din specifika konfiguration.

source: If you do not have your /usr tree mounted via NFS (either you only mount other, less vital trees via NFS or don't use NFS mounted trees at all) and don't use a PCMCIA network card, then it's best to start strongSwan at the earliest possible time, thus allowing the NFS mounts to be secured by IPSec. In this case (or if you don't understand or care about this issue), answer "earliest" to this question (the default).
cs: Jestliže nemáte svůj strom /usr připojen skrz NFS (buď přes NFS připojujete jiné, ne tak důležité stromy, nebo NFS vůbec nepoužíváte) a nepoužíváte síťovou kartu PCMCIA, je nejlepší spouštět strongSwan co nejdříve, čímž umožníte aby byly NFS svazky chráněny pomocí IPSec. V takovém případě (nebo pokud si nejste jisti, nebo pokud vám na tom nezáleží) na otázku odpovězte „co nejdříve“ (výchozí).
de: Falls Sie Ihren /usr-Baum nicht über NFS eingehängt haben (entweder weil Sie nur andere, weniger lebenswichtige Bäume über NFS einhängen, oder falls Sie NFS überhaupt nicht verwenden) und keine PCMCIA-Netzwerkkarte benutzen, ist es am besten, strongSwan so früh wie möglich zu starten und damit durch IPSec gesicherte NFS-Einhängungen zu erlauben. In diesem Fall (oder falls Sie dieses Problem nicht verstehen oder es Ihnen egal ist), antworten Sie »frühestmöglich« (Standardwert) auf diese Frage.
fr: Si votre arborescence /usr n'est pas un montage NFS (soit parce que vos montages NFS sont à d'autres endroits, moins critiques, soit parce que vous n'utilisez pas du tout de montage NFS) et si vous n'utilisez pas de carte réseau PCMCIA, il est préférable de démarrer strongSwan le plus tôt possible, ce qui permettra de sécuriser les montages NFS avec IPSec. Dans ce cas (ou bien si vous ne comprenez pas l'objet de la question ou qu'elle ne vous concerne pas), choisissez « le plus tôt possible », qui est le choix par défaut.
ja: NFS 経由で /usr をマウントせず (他のパーティションやあまり重要ではないパーティションを NFS 経由でマウントするか、または NFS マウントを全く使わない)、加えて PCMCIA ネットワークカードを利用していない場合、可能な限り早いタイミングで strongSwan を起動するのがベストです。この設定によって、NFS でのマウントは IPSec で保護されます。この場合 (またはこの問題を理解していないか特に気にしない場合) 、"可能な限り早く"と質問に答えてください (標準設定です) 。
pt: Se não tem a sua estrutura /usr montada via NFS (ou apenas outras estruturas montadas, menos vitais, via NFS ou não usa de todo o NFS para estruturas montadas) e não usar uma placa de rede PCMCIA, então é melhor iniciar o strongSwan o mais cedo possível. Permitindo assim aos pontos de montagem NFS serem protegidos por IPSec. Neste caso (ou se não entende ou não quer saber deste assunto), responda "o mais cedo possível" a esta questão (é o escolha pré-definida).
sv: Om du inte har ditt /usr-träd monterat via NFS (antingen monterar du bara andra, mindre viktiga träd via NFS eller så använder du inte NFS-monterade träd alls) och inte använder ett PCMCIA-nätverkskort, är det bäst att starta strongSwan så tidigt som möjligt och därmed tillåta säkra NFS-monteringar via IPSec. I detta fall (eller om du inte förstår eller bryr dig om detta), svara "tidigast" på denna fråga (standard).

source: If you have your /usr tree mounted via NFS and don't use a PCMCIA network card, then you will need to start strongSwan after NFS so that all necessary files are available. In this case, answer "after NFS" to this question. Please note that the NFS mount of /usr can not be secured by IPSec in this case.
cs: Jestliže máte strom /usr připojen skrz NFS a nepoužíváte síťovou kartu PCMCIA, musíte spustit strongSwan po NFS, aby byly všechny potřebné soubory dostupné. V tomto případě na otázku odpovězte „po NFS“. Uvědomte si prosím, že v tomto případě nemůže být NFS svazek /usr chráněn pomocí IPSec.
de: Falls Sie Ihren /usr-Baum über NFS eingehängt haben und keine PCMCIA-Netzwerkkarte benutzen, müssen Sie strongSwan nach NFS starten, so dass alle benötigten Dateien verfügbar sind. In diesem Fall antworten Sie »nach NFS« auf diese Frage. Bitte beachten Sie, dass NFS-Einhängungen von /usr in diesem Fall nicht über IPSec gesichert werden können.
fr: Si /usr est un montage NFS et que vous n'utilisez pas de carte réseau PCMCIA, vous devrez alors démarrer strongSwan après les services NFS afin que tous les fichiers nécessaires soient disponibles. Dans ce cas, choisissez « Après NFS ». Veuillez noter que le montage NFS de /usr n'est alors pas sécurisé par IPSec.
ja: NFS 経由で /usr をマウントしていて PCMCIA ネットワークカードを使用していない場合は、必要なファイルを利用可能にするために strongSwan を NFS の後で起動しなければなりません。この場合、"NFS 起動後" と答えてください。この時に NFS 経由でマウントされる /usr は、IPSec によるセキュアな状態にはならないということに注意してください。
pt: Se tem o sua estrutura /usr montada via NFS e não usa uma placa de rede PCMCIA, então necessita iniciar o strongSwan depois do NFS para que todos os ficheiros necessários estejam disponíveis. Neste caso, responda "depois do NFS" a esta questão. Por favor note que, neste caso, o mount NFS do /usr não pode ser segurado pelo IPSec.
sv: Om du har ditt /usr-träd monterat via NFS och inte använder ett PCMCIA-nätverkskort, behöver du starta strongSwan efter NFS så att alla nödvändiga filer finns tillgängliga. I detta fall, svara "efter NFS" på denna fråga. Notera dock att NFS-monteringen av /usr inte kan säkras upp via IPSec i detta fall.

source: If you use a PCMCIA network card for your IPSec connections, then you only have to choose to start it after the PCMCIA services. Answer "after PCMCIA" in this case. This is also the correct answer if you want to fetch keys from a locally running DNS server with DNSSec support.
cs: Jestliže používáte PCMCIA síťovou kartu pro vaše IPSec připojení, pak je jedinou možností jej spustit po PCMCIA službách. V tom případě odpovězte „po PCMCIA“. Toto je také správná odpověď, pokud chcete získat klíče z lokálního DNS serveru s podporou DNSSec.
de: Falls Sie eine PCMCIA-Netzwerkkarte für Ihre IPSec-Verbindungen benutzen, dann müssen Sie nur auswählen, dass er nach den PCMCIA-Diensten startet. Antworten Sie in diesem Fall »nach PCMCIA«. Dies ist auch die richtige Antwort, falls Sie Schlüssel von einem lokal laufenden DNS-Server mit DNSSec-Unterstützung abholen wollen.
fr: Si vous utilisez une carte PCMCIA pour vos connexions IPSec, votre seul choix possible est le démarrage après les services PCMCIA. Choisissez alors « Après PCMCIA ». Faites également ce choix si vous souhaitez récupérer les clés d'authentification sur un serveur DNS reconnaissant DNSSec.
ja: IPSec 接続に PCMCIA ネットワークカードを利用していた場合、PCMCIA サービスの起動後に strongSwan を起動する以外に選択はありません。この場合、"PCMCIA 起動後" と答えてください。ローカルで動作している DNSSec 機能を使用している DNS サーバから鍵を取得したい場合でも、この答えをしてください。
pt: Se usa uma placa de rede PCMCIA para as suas ligações IPSec, então só tem de escolher para iniciar depois do serviços PCMCIA. Responda "depois do PCMCIA" neste caso. Esta também é a reposta correcta se quiser obter chaves de um servidor de DNS a correr localmente com suporte para DNSSec.
sv: Om du använder ett PCMCIA-nätverkskort för dina IPSec-anslutningar har du bara valet att starta den efter PCMCIA-tjänsterna. Svara "efter PCMCIA" i detta fall. Detta är också det rätta svaret om du vill hämta nycklar från en lokalt körande DNS-server med DNSSec-stöd.

source: Do you wish to restart strongSwan?
cs: Přejete si restartovat strongSwan?
de: Möchten Sie strongSwan neustarten?
fr: Souhaitez-vous redémarrer strongSwan ?
ja: strongSwan を再起動しますか?
pt: Deseja reiniciar o strongSwan?
sv: Vill du starta om strongSwan?

source: Restarting strongSwan is a good idea, since if there is a security fix, it will not be fixed until the daemon restarts. Most people expect the daemon to restart, so this is generally a good idea. However this might take down existing connections and then bring them back up.
cs: Restartování strongSwan je dobrý nápad, protože v případě, že aktualizace obsahuje bezpečnostní záplatu, nebude opravena dokud se démon nerestartuje. Většina lidí předpokládá restartování démona, takže je to v každém případě správný postup. Nicméně je možné, že existující spojení budou shozena a poté znovu nastavena.
de: Es ist eine gute Idee, strongSwan neuzustarten, da eine Sicherheitskorrektur erst nach dem Neustart des Daemons greift. Die meisten Leute erwarten, dass der Daemon neu startet, daher ist diese Wahl eine gute Idee. Er kann allerdings existierende Verbindungen beenden und erneut aufbauen.
fr: Redémarrer strongSwan est préférable car un éventuel correctif de sécurité ne prendra effet que si le démon est redémarré. La plupart des utilisateurs s'attendent à ce que le démon redémarre et c'est donc le plus souvent le meilleur choix. Cependant, cela pourrait interrompre provisoirement des connexions en cours.
ja: セキュリティ修正があった場合にはデーモンが再起動されるまで修正が反映されません。ですので、strongSwan を再起動するのは良い考えです。ほとんどの人はデーモンを再起動しようとしますが、これは大抵問題ありません。しかし、この作業で現在の接続は切断され、再度繋ぎなおすことになります。
pt: Reiniciar o strongSwan é boa ideia, visto que se houver uma correcção de segurança, não irá ser aplicada até o daemon reiniciar. A maioria das pessoas espera que o daemon reinicie, por isso isto é geralmente uma boa ideia. No entanto isto poderá deitar abaixo ligações existentes e depois ligar de novo.
sv: Att starta om strongSwan är en bra idé, eftersom en eventuell säkerhetsrättning inte kommer rättas till förrän demonen är omstartad. De flesta personer förväntar sig att demonen startar om så detta är generellt sett en bra idé. Detta kan dock eventuellt ta ner existerande anslutningar och sedan ta upp dem igen.

source: Do you wish to support IKEv1?
cs: Přejete si podporu IKEv1?
de: Möchten Sie IKEv1 unterstützen?
fr: Souhaitez-vous gérer IKE v1 ?
pt: Deseja suporte para o IKEv1?
sv: Vill du stödja IKEv1?

source: strongSwan supports both versions of the Internet Key Exchange protocol, IKEv1 and IKEv2. Do you want to start the "pluto" daemon for IKEv1 support when strongSwan is started?
cs: strongSwan podporuje protokol Internet Key Exchange ve verzích 1 a 2 (IKEv1, IKEv2). Přejete si při startu strongSwanu spustit daemona „pluto“ podporujícího IKEv1?
de: strongSwan unterstützt beide Versionen des »Internet Key Exchange«-Protokolls (Schlüsselaustausch über Internet), IKEv1 und IKEv2. Möchten Sie den »pluto«-Daemon für IKEv1-Unterstützung starten, wenn strongSwan gestartet wird.
fr: StrongSwan gère les versions 1 et 2 du protocole d'échange de clés sur Internet (IKE : « Internet Key Exchange »). Veuillez indiquer si le démon « pluto », qui gère la version 1 du protocole, doit être lancé au démarrage de strongSwan.
pt: O strongSwan suporta ambas as versões do protocolo Internet Key Exchange, IKEv1 e IKEv2. Deseja iniciar o daemon "pluto" para suporte ao IKEv1 quando o strongSwan for iniciado?
sv: strongSwan stödjer båda versionerna av nyckelutbytesprotokollet IKE, IKEv1 och IKEv2. Vill du starta "pluto"-demonen för IKEv1-stöd när strongSwan startas?

source: Do you wish to support IKEv2?
cs: Přejete si podporu IKEv2?
de: Möchten Sie IKEv2 unterstützen?
fr: Souhaitez-vous gérer IKE v2 ?
pt: Deseja suporte para o IKEv2?
sv: Vill du stödja IKEv2?

source: strongSwan supports both versions of the Internet Key Exchange protocol, IKEv1 and IKEv2. Do you want to start the "charon" daemon for IKEv2 support when strongSwan is started?
cs: strongSwan podporuje protokol Internet Key Exchange ve verzích 1 a 2 (IKEv1, IKEv2). Přejete si při startu strongSwanu spustit daemona „charon“ podporujícího IKEv2?
de: strongSwan unterstützt beide Versionen des »Internet Key Exchange«-Protokolls (Schlüsselaustausch über Internet), IKEv1 und IKEv2. Möchten Sie den »charon«-Daemon für IKEv2-Unterstützung starten, wenn strongSwan gestartet wird.
fr: StrongSwan gère les versions 1 et 2 du protocole d'échange de clés sur Internet (IKE : « Internet Key Exchange »). Veuillez indiquer si le démon « charon », qui gère la version 2 du protocole, doit être lancé au démarrage de strongSwan.
pt: O strongSwan suporta ambas as versões do protocolo Internet Key Exchange, IKEv1 e IKEv2. Deseja iniciar o daemon "charon" para suporte ao IKEv2 quando o strongSwan for iniciado?
sv: strongSwan stödjer båda versionerna av nyckelutbytesprotokollet IKE, IKEv1 och IKEv2. Vill du starta "charon"-demonen för IKEv2-stöd när strongSwan startas?

source: Do you want to create a RSA public/private keypair for this host?
cs: Přejete si vytvořit veřejný/soukromý pár RSA klíčů pro tento počítač?
de: Möchten Sie ein öffentlich/privates RSA-Schlüsselpaar für diesen Rechner erstellen?
fr: Souhaitez-vous créer une paire de clés RSA publique et privée pour cet hôte ?
ja: このホストの RSA 公開鍵・秘密鍵のキーペアを生成しますか?
pt: Deseja criar um par de chaves públicas/privadas RSA para esta máquina?
sv: Vill du skapa ett publik/privat RSA-nyckelpar för denna värdmaskin?

source: This installer can automatically create a RSA public/private keypair for this host. This keypair can be used to authenticate IPSec connections to other hosts and is the preferred way for building up secure IPSec connections. The other possibility would be to use shared secrets (passwords that are the same on both sides of the tunnel) for authenticating an connection, but for a larger number of connections RSA authentication is easier to administer and more secure.
cs: Tento instalátor může automaticky vytvořit veřejný/soukromý pár RSA klíčů pro tento počítač. Pár klíčů může být využit k autentizaci IPSec spojení na další počítače a je upřednostňovanou cestou pro sestavování bezpečných IPSec spojení. Další možností autentizace je využití sdílených tajemství (hesel, která jsou stejná na obou stranách tunelu), ale pro větší počet spojení je RSA autentizace snazší pro správu a mnohem bezpečnější.
de: Das Installationsprogramm kann automatisch ein öffentliches/privates RSA-Schlüsselpaar für diesen Rechner erstellen. Dieses Schlüsselpaar kann zur Authentifizierung von IPSec-Verbindungen anderer Rechner verwendet werden und ist die bevorzugte Art, sichere IPSec-Verbindungen aufzubauen. Die andere Möglichkeit besteht darin, vorab-verteilte Geheimnisse (Passwörter, die auf beiden Seiten des Tunnels identisch sind) zur Authentifizierung einer Verbindung zu verwenden, aber für eine größere Anzahl an Verbindungen ist die RSA-Authentifizierung einfacher zu administrieren und sicherer.
fr: Cet outil d'installation peut créer automatiquement une paire de clés RSA publique et privée pour cet hôte. Cette paire de clés peut servir à authentifier des connexions IPSec vers d'autres hôtes. Cette méthode est la méthode conseillée pour l'établissement de liaisons IPSec sûres. L'autre possibilité d'authentification à la connexion est l'utilisation d'un secret partagé (« pre-shared key » : des mots de passe identiques aux deux extrémités du tunnel). Toutefois, pour de nombreuses connexions, l'authentification RSA est plus simple à administrer et plus sûre.
ja: このインストーラはこのホストの RSA 公開鍵・秘密鍵のキーペアを自動的に生成できます。このキーペアは他のホストとの IPSec 通信での認証に利用可能で、セキュアな IPSec 通信を確立する方法として好まれています。他に利用可能な方法としては共通鍵 (トンネルの双方で同じパスワード) を通信の認証に利用するというのがありますが、多数の接続に対しては、RSA 認証のほうが管理がより簡単で、よりセキュアです。
pt: Este instalador pode criar automaticamente um par de chaves públicas/privadas RSA para esta máquina. Este par de chaves pode ser usado para autenticar ligações IPSec a outras máquinas e é o método preferido para criar ligações IPSec seguras. A outra possibilidade seria usar segredos partilhados (palavras chaves que são as mesmas em ambos os sentidos do túnel) para autenticação de uma ligação, mas para um largo número de ligações a autenticação por RSA é mais fácil de administrar e mais segura.
sv: Denna installerare kan automatiskt skapa ett publik/privat RSA-nyckelpar för denna värdmaskin. Detta nyckelpar kan användas för att autentisera IPSec-anslutningar till andra värdar och är det sätt som föredras för att bygga upp säkra IPSec-anslutningar. Den andra möjligheten skulle vara att använda delade hemligheter (lösenord som är samma på båda sidor av tunneln) för att autentisera en anslutning men för ett större antal anslutningar är RSA-autentiseringar enklare att administrera och säkrare.

source: If you do not want to create a new public/private keypair, you can choose to use an existing one.
cs: Jestliže si nepřejete vytvořit nový pár klíčů pro tento počítač, můžete si zvolit existující.
de: Falls Sie kein neues öffentliches/privates Schlüsselpaar erstellen wollen, können Sie ein existierendes auswählen.
fr: Si vous ne souhaitez pas créer une paire de clés publique et privée, vous pouvez choisir d'en utiliser une existante.
ja: 新たな公開鍵・秘密鍵のキーペアを生成したくない場合は、既存のキーペアの利用を選択することも可能です。
pt: Se não quiser criar um novo par de chaves pública/privada, pode escolher usar um já existente.
sv: Om du inte vill skapa ett nytt nyckelpar kan du välja ett existerande.

source: x509, plain
cs: x509, prostý
de: x509, einfach
fr: X509, Simple paire
ja: x509, 通常のタイプ
pt: x509, simples
sv: x509, enkel

source: The type of RSA keypair to create:
cs: Typ páru RSA klíčů, který se vytvoří:
de: Die Art des RSA-Schlüsselpaars, das erstellt werden soll:
fr: Type de paire de clés RSA à créer :
ja: 生成する RSA キーペアのタイプ:
pt: O tipo de par de chaves RSA a criar:
sv: Typ av RSA-nyckelpar som ska skapas:

source: It is possible to create a plain RSA public/private keypair for use with strongSwan or to create a X509 certificate file which contains the RSA public key and additionally stores the corresponding private key.
cs: Je možné vytvořit prostý pár RSA klíčů pro použití se strongSwanem, nebo vytvořit soubor s certifikátem X509, který obsahuje veřejný RSA klíč a dodatečně uchovává odpovídající soukromý klíč.
de: Es besteht die Möglichkeit, ein einfaches öffentliches/privates Schlüsselpaar für den Einsatz mit strongSwan oder eine X509-Zertifikatsdatei zu erstellen, die den öffentlichen Schlüssel und zusätzlich den zugehörigen privaten Schlüssel enthält.
fr: Il est possible de créer une simple paire de clés destinée à être utilisée avec strongSwan ou de créer un fichier de certificat X509 qui contient la clé publique RSA et de conserver la clé privée correspondante par ailleurs.
ja: strongSwan で利用する通常の RSA 公開鍵・秘密鍵のキーペアを作れます。あるいは RSA 公開鍵 (さらにはそれに対応する秘密鍵も) を含む X509 証明書ファイルも同様です。
pt: É possível criar um par de chaves pública/privada RSA simples para uso com o strongSwan ou criar um ficheiro certificado X509 que contenha a chave pública RSA e que adicionalmente guarde a correspondente chave privada.
sv: Det är möjligt att skapa ett enkelt publik/privat RSA-nyckelpar för användning med strongSwan eller att skapa en X509-certifikatsfil som innehåller den publika RSA-nyckeln och dessutom lagrar motsvarande privata nyckel.

source: If you only want to build up IPSec connections to hosts also running strongSwan, it might be a bit easier using plain RSA keypairs. But if you want to connect to other IPSec implementations, you will need a X509 certificate. It is also possible to create a X509 certificate here and extract the RSA public key in plain format if the other side runs strongSwan without X509 certificate support.
cs: Pokud chcete vytvořit IPSec spojení jen k počítačům, na kterých taktéž běží strongSwan, může být mnohem jednodušší použít pár prostých RSA klíčů. Pokud se ale chcete připojit k jiným implementacím IPSec, budete potřebovat certifikát X509. Také je možné zde vytvořit certifikát X509 a později, pokud druhá strana používá strongSwan bez podpory certifikátů X509, z něj získat veřejný RSA klíč v prostém formátu.
de: Falls Sie nur IPSec-Verbindungen zu Rechnern aufbauen wollen, auf denen auch strongSwan läuft, könnte es etwas einfacher sein, einfache RSA-Schlüsselpaare zu verwenden. Falls Sie aber mit anderen IPSec-Implementierungen Verbindungen aufnehmen wollen, benötigen Sie ein X509-Zertifikat. Es besteht auch die Möglichkeit, hier ein X509-Zertifikat zu erstellen und den öffentlichen RSA-Schlüssel im einfachen Format zu extrahieren, falls die andere Seite strongSwan ohne X509-Zertifikatsunterstützung betreibt.
fr: Si vous ne prévoyez d'établir des connexions IPSec qu'avec des hôtes utilisant strongSwan, il sera probablement plus facile d'utiliser des clés RSA simples. Mais si vous souhaitez vous connecter à des hôtes utilisant d'autres implémentations d'IPSec, vous aurez besoin d'un certificat X509. Il est également possible de créer un certificat X509 puis d'en extraire une simple clé publique RSA, si l'autre extrémité de la connexion utilise Openswan sans la gestion des certificats X509.
ja: 既に strongSwan を動作させているホストと IPSec 通信を確立したいだけの場合は、通常の RSA キーペアを使用すると多少簡単になります。しかし、他の IPSec 実装との接続を行いたい場合は X509 証明書が必要になります。通信を行う対象のホストが strongSwan を X509 証明書のサポート無しで運用していた場合、ここで X509 証明書を生成してから、後ほど RSA 公開鍵を通常の形式に展開することも可能です。
pt: Se só quiser criar ligações IPSec para máquinas também a correr o strongSwan, poderá ser um pouco mais fácil usar pares de chaves RSA simples. Mas se quiser ligar a outras implementações IPSec, irá precisar de um certificado X509. Também é possível criar aqui um certificado X509 e extrair a chave pública RSA em formato simples se o outro lado correr o strongSwan sem suporte para certificados X509.
sv: Om du bara vill bygga upp IPSec-anslutningar till värdmaskiner som också kör strongSwan kan det vara lite enklare att använda enkla RSA-nyckelpar. Men om du vill ansluta till andra IPSec-implementationer, kommer du behöva ett X509-certifikat. Det är också möjligt att skapa ett X509-certifikat här och plocka ut den publika RSA-nyckeln i enkelt format om den andra sidan kör strongSwan utan stöd för X509-certifikat.
