Repository: JingLinWu/os-strongswan
Catalog: debian/po/*.po
Languages: cs, de, fr, ja, pt, sv

source: Therefore a X509 certificate is recommended since it is more flexible and this installer should be able to hide the complex creation of the X509 certificate and its use in strongSwan anyway.
cs: Certifikát X509 je proto doporučován zejména díky své flexibilitě. Tento instalátor by v měl být schopen skrýt komplexnost vytváření a používání certifikátu ve strongSwanu.
de: Daher wird ein X509-Zertifikat empfohlen, da es flexibler ist und dieses Installationsprogramm in der Lage sein sollte, die komplexe Erstellung des X509-Zertifikates und seinen Einsatz in strongSwan zu verstecken.
fr: Ainsi, il vous est conseillé d'utiliser un certificat X509 car cette méthode est plus souple. Cet outil d'installation devrait vous simplifier la tâche de création et d'utilisation de ce certificat X509 avec strongSwan.
ja: したがって X509 証明書がお勧めです。こちらのほうが柔軟ですし、このインストーラを使えば、X509 証明書の生成や strongSwan での利用に際しての面倒さを隠蔽してくれるはずです。
pt: Assim sendo um certificado X509 é recomendado visto ser mais flexível e este instalador deve ser capaz de esconder a criação complexa do certificado X509 e o seu uso no strongSwan de qualquer das maneiras.
sv: Därför rekommenderas ett X509-certifikat eftersom det är mer flexibelt och denna installerare bör kunna gömma det komplexa skapandet av X509-certifikatet och dess användning i strongSwan ändå.

source: Do you have an existing X509 certificate file for strongSwan?
cs: Vlastníte existující certifikát X509, který chcete použít pro strongSwan?
de: Verfügen Sie über ein existierendes X509-Zertifikat für strongSwan?
fr: Possédez-vous un fichier de certificat X509 existant à utiliser avec strongSwan ?
ja: 既に存在している X509 証明書ファイルを strongSwan で利用しますか?
pt: Tem um ficheiro de certificado X509 existente para o strongSwan?
sv: Har du en existerande X509-certifikatsfil som du vill använda för strongSwan?

source: This installer can automatically extract the needed information from an existing X509 certificate with a matching RSA private key. Both parts can be in one file, if it is in PEM format. If you have such an existing certificate and key file and want to use it for authenticating IPSec connections, then please answer yes.
cs: Instalátor může automaticky získat potřebné informace z existujícího certifikátu X509 s odpovídajícím soukromým RSA klíčem. Jedná-li se o formát PEM, mohou být obě části v jednom souboru. Vlastníte-li takový certifikát a soubor s klíčem a chcete-li je použít pro autentizaci IPSec spojení, odpovězte kladně.
de: Dieses Installationsprogramm kann automatisch die benötigten Informationen aus einem existierenden X509-Zertifikat mit passendem privatem RSA-Schlüssel extrahieren. Beide Teile können in einer Datei sein, falls sie im PEM-Format vorliegt. Falls Sie über solch ein existierendes Zertifikat und eine solche Schlüsseldatei verfügen, und diese für die Authentifizierung von IPSec-Verbindungen verwenden möchten, stimmen Sie bitte zu.
fr: Cet outil d'installation est capable d'extraire automatiquement l'information nécessaire d'un fichier de certificat X509 existant, avec la clé privée RSA correspondante. Les deux parties peuvent se trouver dans un seul fichier, s'il est en format PEM. Indiquez si vous possédez un tel certificat ainsi que la clé privée, et si vous souhaitez vous en servir pour l'authentification des connexions IPSec.
ja: このインストーラは既に存在している X509 証明書から RSA 秘密鍵と照らし合わせて必要な情報を自動的に展開する事が可能です。 PEM 形式の場合、双方を一つのファイルにまとめることも可能です。そのような証明書と鍵のファイルがあり、これらを IPSec 通信での認証に使用したい場合は「はい」と答えてください。
pt: Este instalador pode extrair automaticamente a informação necessária a partir de um certificado X509 existente com uma chave privada RSA que coincida. Ambas as partes podem estar num ficheiro, se estiver no formato PEM. Se tiver tal ficheiro de certificado e chave existente e quiser usar para autenticar conexões IPSec, então por favor responda sim.
sv: Denna installerare kan automatiskt plocka ut den information som behövs från ett existerande X509-certifikat med en matchande privat RSA-nyckel. Båda delarna kan vara i en fil om den är i PEM-format. Om du har ett sådant existerande certifikat och nyckelfil och vill använda det för att autentisera IPSec-anslutningar, svara ja på frågan.

source: File name of your X509 certificate in PEM format:
cs: Jméno souboru s certifikátem X509 ve formátu PEM:
de: Dateiname Ihres X509-Zertifikates im PEM-Format:
fr: Emplacement de votre certificat X509 au format PEM :
ja: PEM 形式の X509 証明書のファイル名:
pt: Nome de ficheiro para o seu certificado X509 em formato PEM:
sv: Platsen för ditt X509-certifikat i PEM-format:

source: Please enter the full location of the file containing your X509 certificate in PEM format.
cs: Zadejte prosím celou cestu k souboru obsahujícímu váš certifikát X509 ve formátu PEM.
de: Bitte geben Sie den kompletten Ort der Datei an, die Ihr X509-Zertifikat im PEM-Format enthält.
fr: Veuillez indiquer l'emplacement du fichier contenant votre certificat X509 au format PEM.
pt: Por favor insira a localização completa do ficheiro que contém o seu certificado X509 em formato PEM.
sv: Ange platsen för den fil som innehåller ditt X509-certifikat i PEM-format.

source: File name of your X509 private key in PEM format:
cs: Jméno souboru se soukromým klíčem X509 ve formátu PEM:
de: Dateiname Ihres privaten X509-Schlüssels im PEM-Format:
fr: Emplacement de votre clé privée X509 au format PEM :
ja: PEM 形式の X509 秘密鍵のファイル名:
pt: Nome do ficheiro da sua chave privada X509 em formato PEM:
sv: Platsen för din privata X509-nyckel i PEM-format:

source: Please enter the full location of the file containing the private RSA key matching your X509 certificate in PEM format. This can be the same file that contains the X509 certificate.
cs: Zadejte prosím absolutní cestu k souboru obsahujícímu soukromý RSA klíč ve formátu PEM odpovídající vašemu certifikátu X509. Může to být stejný soubor jako ten, ve kterém se nachází certifikát X509.
de: Bitte geben Sie den kompletten Ort der Datei an, die den privaten RSA-Schlüssel enthält, der zu Ihrem X509-Zertifikat im PEM-Format passt. Dies kann die gleiche Datei sein, die auch das X509-Zertifikat enthält.
fr: Veuillez indiquer l'emplacement du fichier contenant la clé privée RSA correspondant à votre certificat X509 au format PEM. Cela peut être le fichier qui contient le certificat X509.
ja: PEM 形式の X509 証明書に対応する RSA 秘密鍵を含んでいるファイルの場所を絶対パスで入力してください。これは X509 証明書を含んでいるファイルと同じで構いません。
pt: Por favor insira a localização completa do ficheiro que contém a chave privada RSA que coincide com o seu certificado X509 em formato PEM. Este pode ser o mesmo ficheiro que contém o certificado X509.
sv: Ange platsen för den fil som innehåller den privata RSA-nyckeln som matchar ditt X509-certifikat i PEM-format. Detta kan vara samma fil som innehåller X509-certifikatet.

source: The length of the created RSA key (in bits):
cs: Délka vytvořeného RSA klíče (v bitech):
de: Die Länge des erstellten RSA-Schlüssels (in Bits):
fr: Longueur (en bits) de la clé RSA à créer :
ja: RSA 鍵の鍵長（ビット数）:
pt: O tamanho da chave RSA criada (em bits):
sv: Längd på den skapade RSA-nyckeln (i bitar):

source: Please enter the length of the created RSA key. It should not be less than 1024 bits because this should be considered unsecure and you will probably not need anything more than 2048 bits because it only slows the authentication process down and is not needed at the moment.
cs: Zadejte prosím délku vytvářeného RSA klíče. Kvůli bezpečnosti by neměla být menší než 1024 bitů a pravděpodobně nepotřebujete víc než 2048 bitů, protože to již zpomaluje proces autentizace.
de: Bitte geben Sie die Länge des erstellten RSA-Schlüssels an. Er sollte nicht kürzer als 1024 Bits sein, da dies als unsicher betrachtet werden könnte und Sie benötigen nicht mehr als 2048 Bits, da dies nur den Authentifizierungs-Prozess verlangsamt und derzeit nicht benötigt wird.
fr: Veuillez indiquer la longueur de la clé RSA qui sera créée. Elle ne doit pas être inférieure à 1024 bits car cela serait considéré comme insuffisamment sûr. Un choix excédant 2048 bits est probablement inutile car cela ne fait essentiellement que ralentir le processus d'authentification sans avoir d'intérêt actuellement.
pt: Por favor insira o tamanho da chave RSA criada. Não deve ser menos do que 1024 bits porque seria considerada insegura e não irá provavelmente necessitar de mais do que 2048 bits porque só torna o processo de autenticação mais lento e não é necessário de momento.
sv: Ange längden för den skapade RSA-nyckeln. Den bör inte vara kortare än 1024 bitar, eftersom detta anses som osäkert, och du vill antagligen inte ha något längre än 2048 bitar, eftersom det bara gör autentiseringsprocessen långsammare och inte är nödvändigt just nu.

source: Do you want to create a self-signed X509 certificate?
cs: Chcete vytvořit certifikát X509 podepsaný sám sebou?
de: Möchten Sie ein selbst-signiertes X509-Zertifikat erstellen?
fr: Souhaitez-vous créer un certificat X509 autosigné ?
ja: 自己署名 X509 証明書を生成しますか?
pt: Deseja criar um certificado X509 auto-assinado?
sv: Vill du skapa ett självsignerat X509-certifikat?

source: This installer can only create self-signed X509 certificates automatically, because otherwise a certificate authority is needed to sign the certificate request. If you want to create a self-signed certificate, you can use it immediately to connect to other IPSec hosts that support X509 certificate for authentication of IPSec connections. However, if you want to use the new PKI features of strongSwan >= 1.91, you will need to have all X509 certificates signed by a single certificate authority to create a trust path.
cs: Tento instalátor může automaticky vytvořit pouze certifikát X509 podepsaný sám sebou, jelikož v opačném případě je k podpisu certifikátu potřeba certifikační autorita. Tento certifikát můžete ihned použít k připojení na další počítače s IPSec, které podporují autentizaci pomocí certifikátu X509. Nicméně chcete-li využít nových PKI možností strongSwanu >= 1.91, budete k vytvoření důvěryhodných cest potřebovat všechny certifikáty X509 podepsané jedinou certifikační autoritou.
de: Das Installationsprogramm kann nur selbst-signierte X509-Zertifikate automatisch erstellen, da andernfalls eine Zertifizierungsstelle zur Signatur der Zertifikatsanfrage benötigt wird. Falls Sie ein selbst-signiertes Zertifikat erstellen möchten, können Sie es sofort zur Verbindung mit anderen IPSec-Rechnern verwenden, die X509-Zertifikate zur Authentifizierung von IPSec-Verbindungen verwenden. Falls Sie allerdings die neuen PKI-Funktionalitäten von strongSwan >= 1.91 verwenden möchten, müssen alle X509-Zertifikate von einer einzigen Zertifizierungsstelle signiert sein, um einen vertrauensvollen Pfad zu etablieren.
fr: Cet outil d'installation ne peut créer automatiquement qu'un certificat X509 autosigné puisqu'une autorité de certification est indispensable pour signer la demande de certificat. Si vous choisissez de créer un certificat autosigné, vous pourrez vous en servir immédiatement pour vous connecter aux hôtes qui authentifient les connexions IPSec avec des certificats X509. Cependant, si vous souhaitez utiliser les nouvelles fonctionnalités PKI de strongSwan >= 1.91, vous aurez besoin que tous les certificats X509 soient signés par la même autorité de certification afin de créer un chemin de confiance.
ja: 証明書要求に署名するためには認証局が必要となるので、このインストーラでは自己署名 X509 証明書を自動的に生成する事だけが可能です。自己署名証明書を生成したい場合、これを使用してすぐに X509 証明書をサポートしている他の IPSec ホストに接続可能です。しかし、strongSwan バージョン 1.91 以上での新しい PKI 機能を使いたい場合は、trust path を生成するために単一の認証局によってすべての X509 証明書に署名してもらう必要があります。
pt: Este instalador só pode criar automaticamente certificados X509 auto-assinados, porque de outra forma seria necessária uma autoridade de certificados para assinar o pedido de certificado. Se quiser criar um certificado auto-assinado, poderá usá-lo imediatamente para ligar a outras máquinas IPSec que suportem certificados X509 para autenticação de ligações IPSec. No entanto, se quiser usar as novas funcionalidades PKI do strongSwan >= 1.91, irá precisar de ter todos os certificados X509 assinados por uma só autoridade de certificados para criar um caminho de confiança.
sv: Denna installerare kan bara skapa självsignerade X509-certifikat automatiskt, eftersom det annars behövs en certifikatsutställare som kan signera certifikatsförfrågan. Om du vill skapa ett självsignerat certifikat, kan du använda det omedelbart för att ansluta till andra IPSec-värdar som har stöd för X509-certifikat för autentisering för IPSec-anslutningar. Om du vill använda de nya PKI-funktionerna i strongSwan >= 1.91, behöver du dock ha alla X509-certifikat signerade av en enda certifikatsutställare för att skapa en pålitlig väg.

source: If you do not want to create a self-signed certificate, then this installer will only create the RSA private key and the certificate request and you will have to get the certificate request signed by your certificate authority.
cs: Jestliže nechcete vytvořit certifikát podepsaný sebou samým, vytvoří tento instalátor jen soukromý RSA klíč a požadavek na certifikát. Vy potom musíte podepsat požadavek svojí certifikační autoritou.
de: Falls Sie kein selbst-signiertes Zertifikat erstellen möchten, wird dieses Installationsprogramm nur einen privaten RSA-Schlüssel und die Zertifikatsanfrage erstellen und Sie müssen die Zertifikatsanfrage von Ihrer Zertifizierungsstelle signiert bekommen.
fr: Si vous ne voulez pas créer de certificat autosigné, cet outil d'installation ne fera que créer la clé privée RSA et la demande de certificat, que vous devrez ensuite faire signer par votre autorité de certification.
pt: Se não quiser criar um certificado auto-assinado, então este instalador só irá criar a chave privada RSA e o pedido de certificado e você terá que ter o pedido de certificado assinado pela sua autoridade de certificados.
sv: Om du inte vill skapa ett självsignerat certifikat, kommer denna installerare bara att skapa den privata RSA-nyckeln och den certifikatsförfrågan som du behöver få signerad av din certifikatsutställare.

source: Country code for the X509 certificate request:
cs: Kód země pro požadavek na certifikát X509:
de: Ländercode für die X509-Zertifizierungsanfrage:
fr: Code du pays :
ja: X509 証明書要求に記載する国コード:
pt: Código de país para o pedido de certificado X509:
sv: Landskod för X509-certifikatsförfrågan:

source: Please enter the 2 letter country code for your country. This code will be placed in the certificate request.
cs: Zadejte prosím dvoumístný kód vaší země. Tento kód bude umístěn do požadavku na certifikát.
de: Bitte geben Sie den zweibuchstabigen Ländercode für Ihr Land ein. Dieser Code wird in der Zertifikatsanfrage verwendet.
fr: Veuillez indiquer le code à deux lettres de votre pays. Ce code sera inclus dans la demande de certificat.
ja: あなたの国の国コードを2文字で入力してください。このコードは証明書要求に記載されます。
pt: Por favor insira o código do país, de 2 letras, correspondente ao seu país. Este código será colocado no pedido de certificado.
sv: Ange en landskod med 2 bokstäver för ditt land. Denna kod kommer att placeras i certifikatsförfrågan.

source: You really need to enter a valid country code here, because openssl will refuse to generate certificates without one. An empty field is allowed for any other field of the X.509 certificate, but not for this one.
cs: Je opravdu nutné, abyste vložili správný kód země, protože openssl jinak odmítne vygenerování certifikátu. Prázdné pole je dovoleno ve všech ostatních polích certifikátu X509 kromě tohoto.
de: Sie müssen wirklich einen gültigen Ländercode hier eingeben, da OpenSSL es ablehnen wird, Zertifikate ohne diese zu erstellen. Jedes andere Feld im X509-Zertifikat darf leer bleiben; dieses aber nicht.
fr: Il est impératif de choisir ici un code de pays valide sinon OpenSSL refusera de générer les certificats. Tous les autres champs d'un certificat X.509 peuvent être vides, sauf celui-ci.
ja: openssl が国コードなしでは証明書の生成を拒否するので、正しい国コードをここで入力する必要があります。X.509 証明書では、他のフィールドについては空でも構いませんが、これについては許可されていません。
pt: Tem mesmo de inserir aqui um código de país válido, porque o openssl irá recusar gerar certificados sem um. Um campo vazio é permitido para qualquer outro campo do certificado X.509, mas não para este.
sv: Du behöver verkligen ange en giltig landskod här, eftersom openssl annars kommer vägra att generera ett certifikat. Ett tomt fält är tillåtet för alla andra fält i X509-certifikatet men inte för detta.

source: Example: AT
cs: Příklad: CZ
de: Beispiel: AT
fr: Exemple : FR
ja: 例: JP
pt: Exemplo: PT
sv: Exempel: SE

source: State or province name for the X509 certificate request:
cs: Jméno státu nebo oblasti pro požadavek na certifikát X509:
de: Name des Landes oder der Provinz für diese X509-Zertifikatsanfrage:
fr: État, province ou région :
ja: X509 証明書要求に記載する都道府県名:
pt: Estado ou nome da província para o pedido do certificado X509:
sv: Region eller län för X509-certifikatsförfrågan:

source: Please enter the full name of the state or province you live in. This name will be placed in the certificate request.
cs: Zadejte prosím celé jméno státu nebo oblasti kde žijete. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie den kompletten Namen des Landes oder der Provinz ein, in der Sie leben. Dieser Name wird in der Zertifikatsanfrage verwendet.
fr: Veuillez indiquer le nom complet de l'état, de la province ou de la région où vous résidez. Ce nom sera inclus dans la demande de certificat.
ja: あなたが在住している都道府県を入力してください。これは証明書要求に記載されます。
pt: Por favor insira o nome completo do estado ou província em que vive. Este nome será colocado no pedido de certificado.
sv: Ange det fulla namnet på regionen eller länet du bor i. Detta namn kommer att placeras i certifikatsförfrågan.

source: Example: Upper Austria
cs: Příklad: Morava
de: Beispiel: Oberösterreich
fr: Exemples : Rhône-Alpes, Brabant Wallon, Bouches du Rhône, Québec, Canton de Vaud
ja: 例: Tokyo
pt: Exemplo: Trás-os-Montes
sv: Exempel: Centrala Sverige

source: Locality name for the X509 certificate request:
cs: Jméno lokality pro požadavek na certifikát X509:
de: Örtlichkeitsangabe für die X509-Zertifikatsanfrage:
fr: Localité :
ja: X509 証明書要求に記載する地域名:
pt: Nome da localidade para o pedido de certificado X509:
sv: Lokaliteten för X509-certifikatsförfrågan:

source: Please enter the locality (e.g. city) where you live. This name will be placed in the certificate request.
cs: Zadejte prosím lokalitu (např. město) kde žijete. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie die Örtlichkeit (z.B. Stadt) ein, in der Sie leben. Dieser Name wird in der Zertifikatsanfrage verwandt.
fr: Veuillez indiquer la localité (p. ex. la ville) où vous résidez. Ce nom sera inclus dans la demande de certificat.
ja: あなたの在住している地域の名前 (例: 市町村名) を入力してください。これは証明書要求に記載されます。
pt: Por favor insira a localidade (ex. cidade) onde vive. Este nome irá ser colocado no pedido de certificado.
sv: Ange lokaliteten (exempelvis staden) där du bor. Detta namn kommer att placeras i certifikatsförfrågan.

source: Example: Vienna
cs: Příklad: Olomouc
de: Beispiel: Wien
fr: Exemple : Saint-Étienne
ja: 例: Shinjuku-ku
pt: Exemplo: Vila Real
sv: Exempel: Stockholm

source: Organization name for the X509 certificate request:
cs: Název organizace pro požadavek na certifikát X509:
de: Organisationsname für die X509-Zertifikatsanfrage:
fr: Organisme :
ja: X509 証明書要求に記載する組織名:
pt: Nome da organização para o pedido de certificado X509:
sv: Organisationsnamnet för X509-certifikatsförfrågan:

source: Please enter the organization (e.g. company) that the X509 certificate should be created for. This name will be placed in the certificate request.
cs: Zadejte prosím organizaci pro kterou je certifikát vytvářen. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie die Organisation (z.B. Firma) ein, für die das X509-Zertifikat erstellt werden soll. Dieser Name wird in der Zertifikatsanfrage verwandt.
fr: Veuillez indiquer l'organisme (p. ex. l'entreprise) pour qui sera créé le certificat X509. Ce nom sera inclus dans la demande de certificat.
ja: X509 証明書の生成対象となるべき組織 (例: 会社) を入力してください。これは証明書要求に記載されます。
pt: Por favor insira a organização (ex. firma) para o qual o certificado X509 deve ser criado. Este nome irá ser colocado no pedido de certificado.
sv: Ange organisationen (exempelvis företaget) som X509-certifikatet ska skapas för. Detta namn kommer att placeras i certifikatsförfrågan.

source: Example: Debian
cs: Příklad: Debian
de: Beispiel: Debian
fr: Exemple : Debian
ja: 例: Debian
pt: Exemplo: Debian
sv: Exempel: Debian

source: Organizational unit for the X509 certificate request:
cs: Název organizační jednotky pro požadavek na certifikát X509:
de: Organisationseinheit für die X509-Zertifikatsanfrage:
fr: Unité d'organisation :
ja: X509 証明書要求に記載する組織単位:
pt: Unidade da organização para o pedido de certificado X509:
sv: Organisationsenheten för X509-certifikatsförfrågan:

source: Please enter the organizational unit (e.g. section) that the X509 certificate should be created for. This name will be placed in the certificate request.
cs: Zadejte prosím organizační jednotku pro kterou je certifikát vytvářen. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie die Organisationseinheit (z.B. Bereich) ein, für die das X509-Zertifikat erstellt werden soll. Dieser Name wird in der Zertifikatsanfrage verwandt.
fr: Veuillez indiquer l'unité d'organisation (p. ex. département, division, etc.) pour qui sera créé le certificat X509. Ce nom sera inclus dans la demande de certificat.
ja: X509 証明書の生成対象となるべき組織単位 (例: 部署名) を入力してください。これは証明書要求に記載されます。
pt: Por favor insira a unidade da organização (ex. departamento) para o qual o certificado X509 deve ser criado. Este nome irá ser colocado no pedido de certificado.
sv: Ange organisationsenheten (exempelvis avdelningen) som X509-certifikatet ska skapas för. Detta namn kommer att placeras i certifikatsförfrågan.

source: Example: security group
cs: Příklad: bezpečnostní oddělení
de: Beispiel: Sicherheitsgruppe
fr: Exemple : Département Réseaux et Informatique Scientifique
ja: 例: security group
pt: Exemplo: grupo de segurança
sv: Exempel: säkerhetsgruppen

source: Common name for the X509 certificate request:
cs: Obvyklé jméno pro požadavek na certifikát X509:
de: Allgemeiner Name für die X509-Zertifikatsanfrage:
fr: Nom commun :
ja: X509 証明書要求に記載するコモンネーム:
pt: Nome comum para o pedido de certificado X509:
sv: Namnet för X509-certifikatsförfrågan:

source: Please enter the common name (e.g. the host name of this machine) for which the X509 certificate should be created for. This name will be placed in the certificate request.
cs: Zadejte prosím běžné jméno (např. jméno počítače) pro které je certifikát vytvářen. Toto jméno bude umístěno do požadavku na certifikát.
de: Bitte geben Sie den allgemeinen Namen (z.B. den Rechnernamen dieser Maschine) ein, für den das X509-Zertifikat erstellt werden soll. Dieser Name wird in der Zertifikatsanfrage verwandt.
fr: Veuillez indiquer le nom commun (p. ex. le nom réseau de cette machine) pour qui sera créé le certificat X509. Ce nom sera inclus dans la demande de certificat.
ja: X509 証明書の生成対象となるべきコモンネーム (例: このマシンのホスト名) を入力してください。これは証明書要求に記載されます。
pt: Por favor insira o nome comum (ex. o nome desta máquina) para o qual o certificado X509 deve ser criado. Este nome irá ser colocado no pedido de certificado.
sv: Ange namnet (exempelvis värdnamnet för denna maskin) som X509-certifikatet ska skapas för. Detta namn kommer att placeras i certifikatsförfrågan.

source: Example: gateway.debian.org
cs: Příklad: gateway.debian.org
de: Beispiel: gateway.debian.org
fr: Exemple : gateway.debian.org
ja: 例: gateway.debian.org
pt: Exemplo: gateway.debian.org
sv: Exempel: gateway.debian.org
